Revit 2024 API
PathOfTravelCalculationServerIds.DefaultPathOfTravelCalculationGUID Property
 GUID to represent the default calculation server id.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public static Guid DefaultPathOfTravelCalculationGUID { get; }
Visual Basic
Public Shared ReadOnly Property DefaultPathOfTravelCalculationGUID As Guid
	Get
Visual C++
public:
static property Guid DefaultPathOfTravelCalculationGUID {
	Guid get ();
}
See Also
PathOfTravelCalculationServerIds Class
Autodesk.Revit.DB.Analysis Namespace